# Завдання №7. Виведення числа в стовпчик.

number = int(input("Введіть чотризначне ціле число: "))   # Програма просить користувача ввести дані
num_4 = number % 10                                       # Програма вираховує останнє, четверте число. Залишок після ділення
body = number // 10                                       # Програма вираховує цілу частину - це три перших числа
num_3 = body % 10                                         # Програма вираховує третє число це залишок від попередніх трьох після ділення
body = body // 10                                         # Програма вираховує цілу частину. Тепер це два перших числа
num_2 = body % 10                                         # Програма вираховує друге число це залишок від попередніх двох після ділення
num_1 = body // 10                                        # Програма вираховує перше число це ціла частина від попередніх двох
print(num_1, num_2, num_3, num_4, sep="\n")               # # Програма виводить результат в термінал. У якості розділювача  - перехід на новий рядок